<a href="https://colab.research.google.com/github/michalis0/Business-Intelligence-and-Analytics/blob/master/week6%20-%20SQL2/SQL_Lab2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lab SQL and Python

In [0]:
# Example how to read from Python
import pandas as pd
from sqlalchemy import create_engine
import seaborn as sns
import matplotlib
import matplotlib.pyplot as plt
%matplotlib inline

# create the database
db = create_engine('sqlite://', echo=False)

# first table
csvfile = 'https://raw.githubusercontent.com/michalis0/Business-Intelligence-and-Analytics/master/week6%20-%20SQL2/data/Players.csv'
df = pd.read_csv(csvfile)
table_name = "Players"
df.to_sql(table_name, con=db) # populate it with the data

# second table
csvfile = 'https://raw.githubusercontent.com/michalis0/Business-Intelligence-and-Analytics/master/week6%20-%20SQL2/data/Teams.csv'
df = pd.read_csv(csvfile)
table_name = "Teams"
df.to_sql(table_name, con=db) # populate it with the data

### <font color = 'green'>World Cup Data</font>

#### Look at a sample of Players and Teams tables

In [2]:
query = "SELECT * FROM Players LIMIT 5"
sql_df = pd.read_sql(query, con=db)
sql_df

   index    surname     team    position  ...  shots  passes  tackles  saves
0      0     Abdoun  Algeria  midfielder  ...      0       6        0      0
1      1    Belhadj  Algeria    defender  ...      1     146        8      0
2      2  Boudebouz  Algeria  midfielder  ...      3      28        1      0
3      3  Bougherra  Algeria    defender  ...      1      89       11      0
4      4   Chaouchi  Algeria  goalkeeper  ...      0      17        0      2

[5 rows x 9 columns]

In [3]:
query = "SELECT * FROM Teams LIMIT 5"
sql_df = pd.read_sql(query, con=db)
sql_df

   index         team  ranking  ...  goalsAgainst  yellowCards  redCards
0      0       Brazil        1  ...             4            7         2
1      1        Spain        2  ...             2            3         0
2      2     Portugal        3  ...             1            8         1
3      3  Netherlands        4  ...             5           15         0
4      4        Italy        5  ...             5            5         0

[5 rows x 11 columns]


#### <font color = 'green'>World Cup Basic Queries</font>

## Question 1
What player on a team containing the string “ia” in the team name played less than 200 minutes and made more than 100 passes? Return the player surname and team. *

__Hint: To check if attribute A contains string S use "A like '%S%'" __

In [0]:
query = """
YOUR QUERY HERE
"""
sql_df = pd.read_sql(query, con=db)
sql_df

      surname    team
0  Kuzmanovic  Serbia

## Question 2.1
Use seaborn to find if there is correlation for players between: `minutes`,`shots`,`passes`, `tackles`.

In [0]:
#hint1: have a look of the last plot of the:"walkthroughs  week 3 BIA"
query = """
YOUR QUERY HERE
"""
sql_df = pd.read_sql(query, con=db)
sql_df

#use .corr(method='pearson') on your sql_df :)

## Question 2.2
 Find all players who made more than 20 shots. Return all player information in descending order of shots made.*

__Hint: SQL ordering syntax: "ORDER BY column1, column2, ... ASC|DESC" __

In [0]:
query = """
YOUR QUERY HERE
"""
sql_df = pd.read_sql(query, con=db)
sql_df

   index surname       team position  minutes  shots  passes  tackles  saves
0    200    Gyan      Ghana  forward      501     27     151        1      0
1    535   Villa      Spain  forward      529     22     169        2      0
2     28   Messi  Argentina  forward      450     21     321       10      0

## Question 3.1 SQL
Find the goalkeepers of teams that played more than four games. List the surname of the goalkeeper, the team, and the number of minutes the goalkeeper played.*

__Hint: You should join the two tables (on which attribute??).

In [0]:
query = """
---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

        surname         team  minutes
0        Romero    Argentina      450
1   Julio Cesar       Brazil      450
2         Neuer      Germany      540
3       Kingson        Ghana      510
4  Stekelenburg  Netherlands      540
5        Villar     Paraguay      480
6      Casillas        Spain      540
7       Muslera      Uruguay      570

## Question 3.2 Data Visalization 
Using seaborn, create a barplot to visualize the time played by all the goalkeepers (descending)
**hint use the dataframe from the sql query of 3.1**

In [0]:

#code here

## Question 4
How many players who play on a team with ranking <10 played more than 350 minutes? Return one number in a column named 'superstar'.*

__Hint: use "SELECT ... AS new_col_name" to rename a column__

In [0]:
query = """
---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

   superstar
0         54

## Question 5
What is the average number of passes made by forwards? By midfielders? Write one query that gives both values with the corresponding position.*

__Hint: use the GROUP BY clause__

__Hint: when selecting columns you can use AVG, SUM or COUNT clauses to calculate aggregates__

In [0]:
query = """
---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

*6) Which team has the highest average number of passes per minute played? Return the team and average passes per minute. *

__Hint 1: You can compute a team's average number of passes per minute played by dividing the total number of passes by the total number of minutes. To force floating point division, multiply one operand by 1.0. __

__Hint 2: Consider using Limit. __

In [0]:
query = """
---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

#### <font color = 'green'>World Cup Advanced Queries</font>

## Question 1

Find all pairs of teams who have the same number of goalsFor as
each other and the same number of goalsAgainst as each other.
Return the teams and numbers of goalsFor and goalsAgainst.
Make sure to return each pair only once.*

__Hint: You basically need to do a self join of the Teams table. For that you need to join different name aliases of the Teams table. checkout [here](https://www.w3schools.com/sql/sql_join_self.asp) for help.__

In [0]:
query = """
select A.team AS team_1, B.team AS team_2, A.goalsFor, A.goalsAgainst
from Teams A, Teams B

TO COMPLETE

"""
sql_df = pd.read_sql(query, con=db)
sql_df

## Question 2
Find all teams with ranking <30 where no player made more than 150 passes. Return the team and ranking.*

__Hint: use HAVING clause (documentation [here](https://www.w3schools.com/sql/sql_having.asp))__

In [0]:
query = """
---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

## Question 3
Which team has the highest ratio of goalsFor to goalsAgainst?*

In [0]:
query = """
---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

## Question 4
Find all teams whose defenders averaged more than 150 passes. Return the team and average number of passes by defenders, in descending order of average passes.*

__Hint: again you may use the HAVING clause here__

In [0]:
query = """
---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

# <font color = 'green'>Titanic Data</font>

In [0]:
# Load table from CSV file
import pandas as pd
from sqlalchemy import create_engine

# create the database
db = create_engine('sqlite://', echo=False)

# Titanic table
csvfile = 'https://raw.githubusercontent.com/michalis0/Business-Intelligence-and-Analytics/master/week6%20-%20SQL2/data/Titanic.csv'
df = pd.read_csv(csvfile)
table_name = "Titanic"
df.to_sql(table_name, con=db) # populate it with the data

## Look at sample of Titanic table

In [0]:
query = """
select * from Titanic 

"""
sql_df = pd.read_sql(query, con=db)
sql_df.head()

   index       last  ...     embarked survived
0      0     Braund  ...  Southampton       no
1      1    Cumings  ...    Cherbourg      yes
2      2  Heikkinen  ...  Southampton      yes
3      3   Futrelle  ...  Southampton      yes
4      4      Allen  ...  Southampton       no

[5 rows x 9 columns]

## <font color = 'green'>Titanic Basic Queries</font>

## Question 1
How many married women over age 50 embarked in Cherbourg? Note: To check if attribute A begins with string S use "A like 'S%'"*

In [0]:
query = """

select count(*) from Titanic where Titanic.gender == 'F' 
AND Titanic.embarked like 'Cherbourg%'
AND Titanic.age > 50

"""
sql_df = pd.read_sql(query, con=db)
sql_df

   count(*)
0         6

## Question 2.1
Create a boxplot the fare paid by passengers in each of the embarkation cities.

In [0]:
#use seaborn

## Question 2.2 
List the average fare paid by passengers in each of the embarkation cities (along with the city), in descending order of average fare.*

In [0]:
query = """

---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

## Question 3.1 
What's the most common last name among passengers?*

In [0]:
query = """

---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

## Question 3.2 
Use barplot to visualize and order the previous data.

In [0]:
#you can use seaborn or matplolib

## Question 3.3 
Write three queries: the total number of passengers; the number of passengers under 30; the number of passengers 30 or older. Why do the second and third numbers not add up to the first?*

In [0]:
query = """

---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

In [0]:
query = """

---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

In [0]:
query = """

---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

## Question 5 
Blanks in SQL tables are given a special value called 'null', and conditions 'A is null' and 'A is not null' can be used in Where clauses to check whether attribute A has the 'null' value. How many passengers don't have a value for age? Now do your numbers add up?*

In [0]:
query = """

---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df

## Question 6 
For male survivors, female survivors, male non-survivors, and female non-survivors, how many passengers were in each of those four categories and what was their average fare paid?*

In [0]:
query = """

---YOUR QUERY HERE ----

"""
sql_df = pd.read_sql(query, con=db)
sql_df